MAKblC/MGBotBoards/esp32-2.0.11/boards.txt
# Official Espressif options
menu.UploadSpeed=Upload Speed
menu.USBMode=USB Mode
menu.CDCOnBoot=USB CDC On Boot
menu.MSCOnBoot=USB Firmware MSC On Boot
menu.DFUOnBoot=USB DFU On Boot
menu.UploadMode=Upload Mode
menu.CPUFreq=CPU Frequency
menu.FlashFreq=Flash Frequency
menu.FlashMode=Flash Mode
menu.FlashSize=Flash Size
menu.PartitionScheme=Partition Scheme
menu.DebugLevel=Core Debug Level
menu.PSRAM=PSRAM
menu.LoopCore=Arduino Runs On
menu.EventsCore=Events Run On
menu.MemoryType=Memory Type
menu.EraseFlash=Erase All Flash Before Sketch Upload
menu.JTAGAdapter=JTAG Adapter

# Custom options
menu.Revision=Board Revision
menu.LORAWAN_REGION=LoRaWan Region
menu.LoRaWanDebugLevel=LoRaWan Debug Level
menu.LORAWAN_DEVEUI=LoRaWan DevEUI
menu.LORAWAN_PREAMBLE_LENGTH=LoRaWan Preamble Length

##############################################################
### DO NOT PUT BOARDS ABOVE THE OFFICIAL ESPRESSIF BOARDS! ###
##############################################################

esp32cam.name=MGB-CAM

esp32cam.bootloader.tool=esptool_py
esp32cam.bootloader.tool.default=esptool_py

esp32cam.upload.tool=esptool_py
esp32cam.upload.tool.default=esptool_py
esp32cam.upload.tool.network=esp_ota

esp32cam.upload.maximum_size=3145728
esp32cam.upload.maximum_data_size=327680
esp32cam.upload.flags=
esp32cam.upload.extra_flags=
esp32cam.upload.speed=460800

esp32cam.serial.disableDTR=true
esp32cam.serial.disableRTS=true

esp32cam.build.tarch=xtensa
esp32cam.build.bootloader_addr=0x1000
esp32cam.build.target=esp32
esp32cam.build.mcu=esp32
esp32cam.build.core=esp32
esp32cam.build.variant=esp32
esp32cam.build.board=ESP32_DEV
esp32cam.build.flash_size=4MB
esp32cam.build.partitions=huge_app
esp32cam.build.defines=-DBOARD_HAS_PSRAM -mfix-esp32-psram-cache-issue -mfix-esp32-psram-cache-strategy=memw
esp32cam.build.extra_libs=
esp32cam.build.code_debug=0

esp32cam.menu.CPUFreq.240=240MHz (WiFi/BT)
esp32cam.menu.CPUFreq.240.build.f_cpu=240000000L
esp32cam.menu.CPUFreq.160=160MHz (WiFi/BT)
esp32cam.menu.CPUFreq.160.build.f_cpu=160000000L
esp32cam.menu.CPUFreq.80=80MHz (WiFi/BT)
esp32cam.menu.CPUFreq.80.build.f_cpu=80000000L
esp32cam.menu.CPUFreq.40=40MHz (40MHz XTAL)
esp32cam.menu.CPUFreq.40.build.f_cpu=40000000L
esp32cam.menu.CPUFreq.26=26MHz (26MHz XTAL)
esp32cam.menu.CPUFreq.26.build.f_cpu=26000000L
esp32cam.menu.CPUFreq.20=20MHz (40MHz XTAL)
esp32cam.menu.CPUFreq.20.build.f_cpu=20000000L
esp32cam.menu.CPUFreq.13=13MHz (26MHz XTAL)
esp32cam.menu.CPUFreq.13.build.f_cpu=13000000L
esp32cam.menu.CPUFreq.10=10MHz (40MHz XTAL)
esp32cam.menu.CPUFreq.10.build.f_cpu=10000000L

esp32cam.menu.FlashMode.qio=QIO
esp32cam.menu.FlashMode.qio.build.flash_mode=dio
esp32cam.menu.FlashMode.qio.build.boot=qio
esp32cam.menu.FlashMode.dio=DIO
esp32cam.menu.FlashMode.dio.build.flash_mode=dio
esp32cam.menu.FlashMode.dio.build.boot=dio
esp32cam.menu.FlashMode.qout=QOUT
esp32cam.menu.FlashMode.qout.build.flash_mode=dout
esp32cam.menu.FlashMode.qout.build.boot=qout
esp32cam.menu.FlashMode.dout=DOUT
esp32cam.menu.FlashMode.dout.build.flash_mode=dout
esp32cam.menu.FlashMode.dout.build.boot=dout

esp32cam.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
esp32cam.menu.PartitionScheme.huge_app.build.partitions=huge_app
esp32cam.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
esp32cam.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
esp32cam.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
esp32cam.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080
esp32cam.menu.PartitionScheme.default=Regular 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
esp32cam.menu.PartitionScheme.default.build.partitions=default
esp32cam.menu.PartitionScheme.defaultffat=Regular 4MB with ffat (1.2MB APP/1.5MB FATFS)
esp32cam.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
esp32cam.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
esp32cam.menu.PartitionScheme.minimal.build.partitions=minimal
esp32cam.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
esp32cam.menu.PartitionScheme.no_ota.build.partitions=no_ota
esp32cam.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
esp32cam.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
esp32cam.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
esp32cam.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
esp32cam.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
esp32cam.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
esp32cam.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
esp32cam.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
esp32cam.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
esp32cam.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576

esp32cam.menu.FlashFreq.80=80MHz
esp32cam.menu.FlashFreq.80.build.flash_freq=80m
esp32cam.menu.FlashFreq.40=40MHz
esp32cam.menu.FlashFreq.40.build.flash_freq=40m

esp32cam.menu.DebugLevel.none=None
esp32cam.menu.DebugLevel.none.build.code_debug=0
esp32cam.menu.DebugLevel.error=Error
esp32cam.menu.DebugLevel.error.build.code_debug=1
esp32cam.menu.DebugLevel.warn=Warn
esp32cam.menu.DebugLevel.warn.build.code_debug=2
esp32cam.menu.DebugLevel.info=Info
esp32cam.menu.DebugLevel.info.build.code_debug=3
esp32cam.menu.DebugLevel.debug=Debug
esp32cam.menu.DebugLevel.debug.build.code_debug=4
esp32cam.menu.DebugLevel.verbose=Verbose
esp32cam.menu.DebugLevel.verbose.build.code_debug=5

esp32cam.menu.EraseFlash.none=Disabled
esp32cam.menu.EraseFlash.none.upload.erase_cmd=
esp32cam.menu.EraseFlash.all=Enabled
esp32cam.menu.EraseFlash.all.upload.erase_cmd=-e

##############################################################

mgbot-iotik32a.name=MGBOT IOTIK 32A

mgbot-iotik32a.bootloader.tool=esptool_py
mgbot-iotik32a.bootloader.tool.default=esptool_py

mgbot-iotik32a.upload.tool=esptool_py
mgbot-iotik32a.upload.tool.default=esptool_py
mgbot-iotik32a.upload.tool.network=esp_ota

mgbot-iotik32a.upload.maximum_size=1310720
mgbot-iotik32a.upload.maximum_data_size=327680
mgbot-iotik32a.upload.flags=
mgbot-iotik32a.upload.extra_flags=

mgbot-iotik32a.serial.disableDTR=true
mgbot-iotik32a.serial.disableRTS=true

mgbot-iotik32a.build.tarch=xtensa
mgbot-iotik32a.build.bootloader_addr=0x1000
mgbot-iotik32a.build.target=esp32
mgbot-iotik32a.build.mcu=esp32
mgbot-iotik32a.build.core=esp32
mgbot-iotik32a.build.variant=mgbot-iotik32a
mgbot-iotik32a.build.board=MGBOT_IOTIK32A

mgbot-iotik32a.build.f_cpu=240000000L
mgbot-iotik32a.build.flash_size=4MB
mgbot-iotik32a.build.flash_freq=40m
mgbot-iotik32a.build.flash_mode=dio
mgbot-iotik32a.build.boot=dio
mgbot-iotik32a.build.partitions=default
mgbot-iotik32a.build.defines=

